pabloleonbarriga/TIVALOCK-Cerradura-Inteligente-TM4C1294/ENTREGA_PROYECTO/archivos_TIVA_LOCK/ft800_TIVA.c
}

void ComNum(int x, int y, int fuente, int ops, unsigned long Num)
{
			EscribeRam32(CMD_NUMBER);
	        EscribeRam16(x);
	        EscribeRam16(y);
	        EscribeRam16(fuente);
	        EscribeRam16(ops);
	        EscribeRam32(Num);
	        PadFIFO();
}
void ComTeclas(int x, int y, int w, int h, int fuente, unsigned int ops, char *Keys)
{
	EscribeRam32(CMD_KEYS);
    EscribeRam16(x);
	EscribeRam16(y);
    EscribeRam16(w);
	EscribeRam16(h);
	EscribeRam16(fuente);
	EscribeRam16(ops);
	while(*Keys) EscribeRam8(*Keys++);
    EscribeRam8(0);
PadFIFO();

}

void Ejecuta_Lista(void){
HAL_SPI_CSLow();                                //
FT800_SPI_SendAddressWR(REG_CMD_WRITE);         //
FT800_SPI_Write16(CMD_Offset);                  //
HAL_SPI_CSHigh();                               //
}

void PadFIFO(void){
	int i, pad;
	pad=CMD_Offset&0x0003;
	if(pad>0){
		for(i=0;i<4-pad;i++) EscribeRam8(0);
	}
}


void Dibuja(void){
	Comando(CMD_DISPLAY);
	Comando(CMD_SWAP);
	Ejecuta_Lista();
}



void Inicia_pantalla(void){
HAL_SPI_PDhigh();                               // Put the Power Down # pin high to wake FT800

Delay();                                        // Delay for power up of regulator

FT800_SPI_HostCommandDummyRead();               // Read location 0 to wake up FT800

FT800_SPI_HostCommand(FT_GPU_EXTERNAL_OSC);     // Change the PLL to external clock - optional

FT800_SPI_HostCommand(FT_GPU_PLL_48M);          //  Ensure configured to 48 MHz

// Note: Could now increase SPI clock rate up to 30MHz SPI if preferred

Delay();                                        // Delay

FT800_SPI_HostCommand(FT_GPU_CORE_RESET);       // Reset the core

Delay();                                        // Delay

FT800_SPI_HostCommand(FT_GPU_ACTIVE_M);         // Read address 0 to ensure FT800 is active

chipid = 0x00;                                  // Read the Chip ID to check comms with the FT800 - should be 0x7C
	while(chipid != 0x7C)
{
    HAL_SPI_CSLow();                            // CS low
    FT800_SPI_SendAddressRD(REG_ID);            // Send the address
    chipid = FT800_SPI_Read8();                 // Read the actual value
    HAL_SPI_CSHigh();
    Delay();// CS high
}


// =======================================================================
// Write the display registers on the FT800 for your particular display
// =======================================================================

HAL_SPI_CSLow();                                // CS low                   Write REG_HCYCLE to 548
FT800_SPI_SendAddressWR(REG_HCYCLE);            // Send the address
FT800_SPI_Write16(HCYCLE);                         // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_HOFFSET to 43
FT800_SPI_SendAddressWR(REG_HOFFSET);           // Send the address
FT800_SPI_Write16(HOFFSET);                          // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_HSYNC0 to 0
FT800_SPI_SendAddressWR(REG_HSYNC0);            // Send the address
FT800_SPI_Write16(HSYNC0);                           // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_HSYNC1 to 41
FT800_SPI_SendAddressWR(REG_HSYNC1);            // Send the address
FT800_SPI_Write16(HSYNC1);                          // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_VCYCLE to 292
FT800_SPI_SendAddressWR(REG_VCYCLE);            // Send the address
FT800_SPI_Write16(VCYCLE);                         // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_VOFFSET to 12
FT800_SPI_SendAddressWR(REG_VOFFSET);           // Send the address
FT800_SPI_Write16(VOFFSET);                          // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_VSYNC0 to 0
FT800_SPI_SendAddressWR(REG_VSYNC0);            // Send the address
FT800_SPI_Write16(VSYNC0);                           // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_VSYNC1 to 10
FT800_SPI_SendAddressWR(REG_VSYNC1);            // Send the address
FT800_SPI_Write16(VSYNC1);                          // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_SWIZZLE to 2
FT800_SPI_SendAddressWR(REG_SWIZZLE);           // Send the address
FT800_SPI_Write16(2);                           // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_PCLK_POL to 1
FT800_SPI_SendAddressWR(REG_PCLK_POL);          // Send the address
FT800_SPI_Write16(PCLK_POL);                           // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_HSIZE to 480
FT800_SPI_SendAddressWR(REG_HSIZE);             // Send the address
FT800_SPI_Write16(HSIZE);                         // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_VSIZE to 272
FT800_SPI_SendAddressWR(REG_VSIZE);             // Send the address
FT800_SPI_Write16(VSIZE);                         // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

HAL_SPI_CSLow();                                // CS low                   Write REG_PCLK to 5
FT800_SPI_SendAddressWR(REG_PCLK);              // Send the address
FT800_SPI_Write16(PCLK);                           // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

// CONFIGURACION ROTADO PANTALLA 180 GRADOS
HAL_SPI_CSLow();                                // CS low                   Write REG_PCLK to 5
FT800_SPI_SendAddressWR(REG_ROTATE);              // Send the address
FT800_SPI_Write16(0);                           // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high

// =======================================================================
// Configure the touch screen
// =======================================================================

HAL_SPI_CSLow();                                // CS low                   Write the touch threshold
FT800_SPI_SendAddressWR(REG_TOUCH_RZTHRESH);    // Send the address
FT800_SPI_Write16(1200);                        // Send the 16-bit value
HAL_SPI_CSHigh();                               // CS high


// =======================================================================
// Send an initial display list which will clear the screen to a black colour
// =======================================================================

// Set the colour which is used when the colour buffer is cleared
HAL_SPI_CSLow();                                //
FT800_SPI_SendAddressWR(RAM_DL + 0);            // Write first entry in Display List (first location in DL Ram)
FT800_SPI_Write32(0x02000000);                  // Clear Color RGB   00000010 BBBBBBBB GGGGGGGG RRRRRRRR  (B/G/R = Colour values)
HAL_SPI_CSHigh();                               //

// Clear the Colour, Stencil and Tag buffers. This will set the screen to the 'clear' colour set above.
HAL_SPI_CSLow();                                //
FT800_SPI_SendAddressWR(RAM_DL + 4);            // Write next entry in display list (each command is 4 bytes)
FT800_SPI_Write32(0x26000007);                  // Clear 00100110 -------- -------- -----CST  (C/S/T define which parameters to clear)
HAL_SPI_CSHigh();                               //

