pabloleonbarriga/TIVALOCK-Cerradura-Inteligente-TM4C1294/ENTREGA_PROYECTO/archivos_TIVA_LOCK/ft800_TIVA.c
void ComGradient(int x0,int y0, long color0, int x1, int y1, int color1){
	EscribeRam32(CMD_GRADIENT);
	EscribeRam16(x0);
	EscribeRam16(y0);
	EscribeRam32(color0);
	EscribeRam16(x1);
	EscribeRam16(y1);
	EscribeRam32(color1);

}

void VolNota(unsigned char volumen){
	HAL_SPI_CSLow();
		        FT800_SPI_SendAddressWR(REG_VOL_SOUND);
		        FT800_SPI_Write8(volumen);
		        HAL_SPI_CSHigh();

}
void TocaNota( int instr, int nota)
{
//	char comando;
	HAL_SPI_CSLow();
	        FT800_SPI_SendAddressWR(REG_SOUND);
	        FT800_SPI_Write16(instr+(nota<<8));
	        HAL_SPI_CSHigh();

	        HAL_SPI_CSLow();
	        	        FT800_SPI_SendAddressWR(REG_PLAY);
	        	        FT800_SPI_Write8(1);
	        	        HAL_SPI_CSHigh();

	}

void FinNota(void)
{
//	char comando;
	HAL_SPI_CSLow();
	FT800_SPI_SendAddressWR(REG_SOUND);
	FT800_SPI_Write16(0x0000);
	HAL_SPI_CSHigh();

	HAL_SPI_CSLow();
	FT800_SPI_SendAddressWR(REG_PLAY);
	FT800_SPI_Write8(1);
	HAL_SPI_CSHigh();



}


void Fadeout(void)
{
   int i;

	for (i = 100; i >= 0; i -= 3)
	{
        HAL_SPI_CSLow();
        	        FT800_SPI_SendAddressWR(REG_PWM_DUTY);
       	        FT800_SPI_Write8(i);
    	        HAL_SPI_CSHigh();


    	    	SysCtlDelay(RELOJ/1500);


	}
}

/* API to perform display fadein effect by changing the display PWM from 0 till 100 and finally 128 */
void Fadein()
{
	int i;

	for (i = 0; i <=100 ; i += 3)
	{
		 HAL_SPI_CSLow();
		        	    FT800_SPI_SendAddressWR(REG_PWM_DUTY);
		       	        FT800_SPI_Write8(i);
		    	        HAL_SPI_CSHigh();
		    	    	SysCtlDelay(RELOJ/1500);

		       	        //espera(2);
	}
	i = 128;
	 HAL_SPI_CSLow();
		        	    FT800_SPI_SendAddressWR(REG_PWM_DUTY);
		       	        FT800_SPI_Write8(i);
		    	        HAL_SPI_CSHigh();

}


//----------------------------------------------------------------------------------------------
//--------------------FUNCIONES NUEVAS PARA EL PROYECTO DE CURSO--------------------------------
//----------------------------------------------------------------------------------------------

// Función para mandar por pantalla el comando correspondiente a BITMAP_LAYOUT
void cmd_bmp_layout(int type, int lnstrd,int hght){
    // Variables internas utilizadas en la función
    unsigned long total = 0;
    unsigned long linestride = 0;
    unsigned long height = 0;

    if (type == 0)  // RGB565
    // Mover hacia la izquierda el valor de linestride
        linestride = 2*lnstrd << 9;
    else            // RGB332
        linestride = lnstrd << 9;

    // Almacenar la altura
    height = hght;

    if (type == 0)
    // Calcular el total como la suma de todos los valores
        total = BMP_LAYOUT_HANDLE + BMP_LAYOUT_FMRT_RGB565 + linestride + height;
    else
        total = BMP_LAYOUT_HANDLE + BMP_LAYOUT_FMRT_RGB332 + linestride + height;
    // Mandar el comando (32 bits)
    Comando(total);
}

// Función para mandar por pantalla el comando correspondiente a BITMAP_SIZE
void cmd_bmp_size(int wdth,int hght){
    // Variables internas utilizadas en la función
    unsigned long total = 0;
    unsigned long width = 0;
    unsigned long height = 0;

    // Mover hacia la izquierda el valor de la anchura
    width = wdth << (9);

    // Almacenar la altura
    height = hght;

    // Calcular el total como la suma de todos los valores
    total = BMP_SIZE_HANDLE + BMP_SIZE_WX_WY_WRAPY + width + height;

    // Mandar el comando (32 bits)
    Comando(total);
}

// Función para mandar por pantalla el comando correspondiente a BITMAP_SOURCE
void cmd_bmp_source(int addr){
    // Variables internas utilizadas en la función
    unsigned long total = 0;

    // Calcular el total como la suma de todos los valores
    total = BMP_SOURCE_HANDLE + (unsigned long)addr;

    // Mandar el comando (32 bits)
    Comando(total);
}

// Función para mandar por pantalla el comando correspondiente a ALPHA_A. Modifica la transparencia del bitmap
void cmd_alpha_a(int alpha){
    // Variables internas utilizadas en la función
    unsigned long total = 0;

    // Calcular el total como la suma de todos los valores
    total = COLOR_A_HANDLE + (unsigned long)alpha;

    // Mandar el comando (32 bits)
    Comando(total);
}


// Muestra la imagen almacenada en memoria
void dibujar_imagen_externa(int ram_addr, int ancho, long int alto, int x, int y ,int param, int tipo_RGB){
    // Preparar nueva pantalla
    //    Nueva_pantalla(255, 255, 255);

    // Dibujar BITMAP
    Comando(CMD_BEGIN_BMP);

    // Comando para BITMAP_SOURCE   (ft800 prog guide - pg. 96)
    cmd_bmp_source(ram_addr);

    // Comando para BITMAP_LAYOUT   (ft800 prog guide - pg. 88)     || https://www.ftdichip.com/Support/Documents/AppNotes/AN_303%20FT800%20Image%20File%20Conversion.pdf , pg.11
    cmd_bmp_layout(tipo_RGB, ancho, alto);

    // Comando para BITMAP_SIZE     (ft800 prog guide - pg. 93)     || https://www.ftdichip.com/Support/Documents/AppNotes/AN_303%20FT800%20Image%20File%20Conversion.pdf , pg.11
    cmd_bmp_size(ancho, alto);

    // Comando para ALPHA_A         (ft800 prog guide - pg. 117)    || https://www.ftdichip.com/Support/Documents/AppNotes/AN_303%20FT800%20Image%20File%20Conversion.pdf , pg.11
    cmd_alpha_a(param);

    // Posicion en la pantalla, esquina superior izquierda
    ComVertex2ff(x, y);

    // Finalizar el bitmap
    Comando(CMD_END);

    // Dibujar lo almacenado en la pila de 4k
    //    Dibuja();
}

// Almacena en la memoria ram del FT800 la imagen almacenada en la flash del TM4C mediante LM Flash Programmer
void almacenar_imagen_externa(int flash_addr, int ram_addr, int nbytes_imagen){

    // Preparar nueva pila
    Nueva_pantalla(255, 255, 255);

    // Iniciar el comando cmd_inflate
    Comando(CMD_INFLATE);

    // Posicion de memoria ram de FT800
    Comando(ram_addr);

    int img_ext_indice = 0;

    // Guardar en memoria la información
    for (img_ext_indice = 0; img_ext_indice < nbytes_imagen; img_ext_indice ++){
        EscribeRam8(HWREGB(flash_addr+img_ext_indice));
        //        UARTprintf("%d\r\n",(int)HWREGB(flash_addr+img_ext_indice));
    }

    // Completar hasta llegar a 4 bytes
    PadFIFO();

    // Mandar fin de cmd_inflate
    Comando(CMD_END);

    // Dibuja la pila
    Dibuja();
}
